{
  "generatedAt": "2026-02-12T12:31:34.425983+00:00",
  "count": 20,
  "items": [
    {
      "id": "reddit_1r1zlqx",
      "rank": 1,
      "title": "Reação ao anúncio da Amazon Ring no Super Bowl por preocupações com vigilância em massa",
      "label": "Reação ao anúncio da Ring no Super Bowl",
      "context": "A Amazon exibiu um anúncio no Super Bowl promovendo uma nova funcionalidade de câmeras Ring que usa inteligência artificial para procurar animais perdidos. O comercial gerou reações variadas, incluindo críticas à privacidade e preocupações com vigilância. O debate envolve opiniões sobre o uso de tecnologia de vigilância por empresas e governos.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r1zlqx/amazon_rings_super_bowl_ad_sparks_backlash_amid/",
      "createdAt": "2026-02-11T14:59:19+00:00",
      "rawScore": 959.63522868444,
      "relevanceScore": 1.0,
      "suggestedRadius": 96.0,
      "imageUrl": "assets/images/reddit_1r1zlqx_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "negative",
          "text": "O anúncio mostrou como a vigilância doméstica pode se transformar em uma ferramenta de controle e invasão de privacidade.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op2",
          "tone": "positive",
          "text": "A funcionalidade de procurar animais perdidos é útil e pode ajudar muitas pessoas a reencontrar seus pets com facilidade.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "O debate sobre vigilância e privacidade é antigo, e esse anúncio reacende preocupações sobre o uso de câmeras conectadas em residências.",
          "source": "reddit",
          "votes": 0
        }
      ]
    },
    {
      "id": "reddit_1r1fid6",
      "rank": 2,
      "title": "Busca por alternativas ao Discord aumenta após anúncio de verificação de idade global",
      "label": "Alternativas ao Discord e reação dos usuários",
      "context": "O Discord anunciou uma nova medida de verificação de idade global, solicitando fotos de identidade dos usuários. Essa mudança gerou preocupações sobre privacidade e segurança de dados. Muitos usuários estão considerando ou já migraram para outras plataformas.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r1fid6/discord_alternatives_searches_jump_10000/",
      "createdAt": "2026-02-10T22:33:48+00:00",
      "rawScore": 704.4591140542038,
      "relevanceScore": 0.726859633453784,
      "suggestedRadius": 87.15,
      "imageUrl": "assets/images/reddit_1r1fid6_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Prefiro cancelar minha conta do que compartilhar meus documentos com uma empresa que já teve vazamentos.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essa medida é uma invasão de privacidade e mostra a falta de respeito das empresas com os usuários.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "Muitos estão buscando alternativas por preocupações com privacidade, mas a mudança pode ser difícil devido à integração das comunidades existentes.",
          "source": "reddit",
          "votes": 0
        }
      ]
    },
    {
      "id": "reddit_1r1y50m",
      "rank": 3,
      "title": "Polônia e Itália anunciam que não participarão do Conselho de Paz de Trump",
      "label": "Polônia e Itália recusam Conselho de Paz",
      "context": "Polônia e Itália declararam que não irão participar do Conselho de Paz criado por Trump, que tinha como objetivo promover a resolução de conflitos globais. A decisão foi comunicada oficialmente e faz parte de um debate mais amplo sobre a legitimidade e impacto do conselho. O evento envolve países aliados dos EUA e a controvérsia sobre a iniciativa de Trump.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r1y50m/poland_and_italy_say_they_will_not_join_trumps/",
      "createdAt": "2026-02-11T14:00:28+00:00",
      "rawScore": 565.8282229282428,
      "relevanceScore": 0.5784692072117238,
      "suggestedRadius": 81.63,
      "imageUrl": "assets/images/reddit_1r1y50m_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A decisão de Polônia e Itália reforça a postura de resistência contra uma iniciativa que parece mais uma tentativa de controle do que de paz real.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "A recusa mostra a falta de legitimidade do conselho, que parece ser uma jogada política de Trump para manipular conflitos ao seu favor.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A decisão de Polônia e Itália de não participar reflete divergências sobre a abordagem de Trump para a diplomacia e resolução de conflitos internacionais.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r1sqqp",
      "rank": 4,
      "title": "Orbán afirma que a UE e a Ucrânia declararam guerra à Hungria",
      "label": "Decisão de Orbán sobre guerra com UE e Ucrânia",
      "context": "Orbán declarou que a União Europeia e a Ucrânia 'declararam guerra' à Hungria. A declaração ocorre em um momento de tensões políticas e eleitorais na Hungria. O debate envolve a postura do governo húngaro frente às ações da UE e da Ucrânia.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r1sqqp/orbán_says_eu_and_ukraine_have_declared_war_on/",
      "createdAt": "2026-02-11T09:20:59+00:00",
      "rawScore": 493.3118275661533,
      "relevanceScore": 0.5008476992641125,
      "suggestedRadius": 78.46,
      "imageUrl": "assets/images/reddit_1r1sqqp_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Orbán está defendendo os interesses da Hungria contra a interferência da UE e da Ucrânia, mostrando força e autonomia nacional.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Orbán está exagerando a situação para justificar sua postura autoritária e desrespeitar as instituições europeias e a soberania da Ucrânia.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A declaração de Orbán reflete uma postura de resistência às pressões externas, mas o impacto real dessa declaração na política europeia ainda é incerto.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r228yi",
      "rank": 5,
      "title": "Campanha QuitGPT incentiva cancelamento de assinaturas do ChatGPT",
      "label": "Debate sobre a campanha QuitGPT",
      "context": "Uma campanha chamada QuitGPT está incentivando as pessoas a cancelarem suas assinaturas do ChatGPT. Os comentários refletem opiniões variadas sobre o uso e a importância da ferramenta. O debate envolve questões de tecnologia, economia e política.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r228yi/a_quitgpt_campaign_is_urging_people_to_cancel/",
      "createdAt": "2026-02-11T16:38:49+00:00",
      "rawScore": 400.8712756535082,
      "relevanceScore": 0.4018993855877252,
      "suggestedRadius": 74.04,
      "imageUrl": "assets/images/reddit_1r228yi_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Cancelar o ChatGPT é uma jogada inteligente para proteger a economia e evitar controle excessivo das big techs.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "A campanha é uma tentativa de prejudicar o acesso à tecnologia que pode ajudar na educação e no trabalho, reforçando o controle corporativo.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A decisão de cancelar ou não o ChatGPT depende das necessidades individuais e do entendimento sobre o impacto da ferramenta na sociedade.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r25jeo",
      "rank": 6,
      "title": "Debate sobre o risco de mudança irreversível no clima global",
      "label": "Mudança climática · Debate sobre ponto de não retorno",
      "context": "Cientistas alertam que a Terra pode estar se aproximando de um ponto de não retorno em relação às mudanças climáticas. Comentários discutem a responsabilidade, as ações e o impacto futuro dessa situação. O debate reflete diferentes opiniões sobre o que fazer ou se é possível evitar consequências graves.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r25jeo/point_of_no_return_a_hellish_hothouse_earth/",
      "createdAt": "2026-02-11T18:35:32+00:00",
      "rawScore": 367.15723652975083,
      "relevanceScore": 0.36581189747246645,
      "suggestedRadius": 72.29,
      "imageUrl": "assets/images/reddit_1r25jeo_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A crise climática exige ações rápidas e decisivas, incluindo políticas fortes e investimentos em tecnologia para proteger o futuro da humanidade.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "A responsabilidade é das elites e do sistema capitalista que prioriza lucros, enquanto a maioria sofre com os efeitos e nada muda de verdade.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A mudança climática é uma questão urgente que requer ações coordenadas, incluindo políticas públicas, inovação tecnológica e conscientização da sociedade.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r0w8gn",
      "rank": 7,
      "title": "Início da separação da Europa de sistemas de pagamento Visa e Mastercard",
      "label": "Europa busca alternativa a Visa/Mastercard",
      "context": "A União Europeia está desenvolvendo um sistema de pagamento próprio para reduzir a dependência de empresas americanas como Visa e Mastercard. Essa iniciativa visa aumentar a autonomia financeira dos países europeus. A proposta surge em um contexto de tensões econômicas e geopolíticas globais.",
      "source": "reddit",
      "subreddit": "economics",
      "permalink": "https://www.reddit.com/r/Economics/comments/1r0w8gn/europes_24_trillion_breakup_with_visa_and/",
      "createdAt": "2026-02-10T09:26:19+00:00",
      "rawScore": 350.35055750169226,
      "relevanceScore": 0.3478220378933263,
      "suggestedRadius": 71.39,
      "imageUrl": "assets/images/reddit_1r0w8gn_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Criar uma alternativa europeia fortalece a soberania do continente e reduz o controle de empresas americanas sobre nossas finanças.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essa iniciativa pode complicar o sistema financeiro europeu, aumentando custos e dificultando a cooperação internacional em pagamentos.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A criação de um sistema de pagamento europeu busca diversificar opções e diminuir a dependência de empresas estrangeiras, promovendo maior autonomia financeira.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r22van",
      "rank": 8,
      "title": "Quase metade das munições .50 cal apreendidas pelo governo mexicano veio de fábrica do Exército dos EUA, diz ministro da defesa",
      "label": "Apreensão de munições .50 cal no México",
      "context": "O governo mexicano anunciou que uma grande quantidade de munições .50 cal apreendidas foi produzida por uma fábrica do Exército dos EUA. A declaração foi feita pelo ministro da defesa do México, destacando a origem dessas munições. A questão levanta debates sobre o tráfico de armas e a origem de munições usadas no país.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r22van/nearly_half_of_powerful_50caliber_ammo_seized_by/",
      "createdAt": "2026-02-11T17:01:19+00:00",
      "rawScore": 346.04829345855666,
      "relevanceScore": 0.34321689693245117,
      "suggestedRadius": 71.15,
      "imageUrl": "assets/images/reddit_1r22van_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A origem dessas munições reforça a necessidade de fortalecer a segurança na fronteira e combater o tráfico de armas vindo dos EUA.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essa situação evidencia a falha na fiscalização e na cooperação internacional, permitindo que armas de origem militar cheguem às mãos de criminosos no México.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A origem das munições aponta para a complexidade do mercado de armas e a necessidade de políticas que controlem a circulação de munições de alta potência.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r1y2zt",
      "rank": 9,
      "title": "Evidências de que o TDAH pode estar relacionado a distúrbios do ritmo circadiano",
      "label": "TDAH e ritmo circadiano",
      "context": "Pesquisadores sugerem que o TDAH pode estar ligado a problemas no ciclo de sono e vigília. Estudos indicam que muitos com TDAH apresentam alterações no ritmo circadiano, afetando o sono e o comportamento. A relação ainda está sendo investigada na comunidade científica.",
      "source": "reddit",
      "subreddit": "science",
      "permalink": "https://www.reddit.com/r/science/comments/1r1y2zt/adhd_as_a_circadian_rhythm_disorder_evidence_and/",
      "createdAt": "2026-02-11T13:58:11+00:00",
      "rawScore": 295.0682019413709,
      "relevanceScore": 0.28864783625158996,
      "suggestedRadius": 68.24,
      "imageUrl": "assets/images/reddit_1r1y2zt_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Se o TDAH está ligado ao ritmo circadiano, tratamentos que ajustem o sono podem melhorar bastante a qualidade de vida das pessoas.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Focar apenas no ritmo circadiano pode simplificar demais o TDAH, que é uma condição complexa com múltiplos fatores biológicos e ambientais.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A pesquisa mostra uma possível ligação entre TDAH e distúrbios do sono, mas ainda há muito a entender sobre essa relação e suas implicações para tratamentos.",
          "source": "reddit",
          "votes": 0
        }
      ]
    },
    {
      "id": "reddit_1r2awts",
      "rank": 10,
      "title": "Secretário do Tesouro acusa Coinbase de bloquear legislação importante",
      "label": "Coinbase e legislação · Acusação do Tesouro",
      "context": "O secretário do Tesouro alertou que a Coinbase estaria impedindo a aprovação de uma lei importante. A acusação sugere uma possível influência de empresas privadas na política. O debate envolve interesses corporativos e regulamentação financeira.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r2awts/treasury_secretary_bessent_warns_coinbase_is/",
      "createdAt": "2026-02-11T21:54:58+00:00",
      "rawScore": 292.8233538854263,
      "relevanceScore": 0.2862449521817789,
      "suggestedRadius": 68.1,
      "imageUrl": "assets/images/reddit_1r2awts_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Coinbase está defendendo os interesses do mercado livre e da inovação, resistindo a regulações excessivas que prejudicam o setor financeiro.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Empresas como Coinbase usam seu poder para manipular o sistema político, impedindo leis que poderiam proteger os consumidores e regular o mercado financeiro.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A acusação levanta questões sobre o papel das empresas privadas na política e a necessidade de transparência na influência corporativa sobre a legislação.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r20w76",
      "rank": 11,
      "title": "Pesquisador de segurança em IA deixa cargo alertando sobre risco global",
      "label": "Decisão de pesquisador de IA · Alerta de risco",
      "context": "Um pesquisador de segurança em inteligência artificial anunciou sua saída, alertando que o mundo está em perigo devido ao avanço da tecnologia. A decisão gerou debates sobre os riscos e o controle da IA. Comentários discutem possíveis ameaças e interesses políticos.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r20w76/anthropic_safety_researcher_quits_warning_world/",
      "createdAt": "2026-02-11T15:48:17+00:00",
      "rawScore": 276.7394498228964,
      "relevanceScore": 0.269028750510633,
      "suggestedRadius": 67.12,
      "imageUrl": "assets/images/reddit_1r20w76_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A saída do pesquisador reforça a necessidade de controle forte sobre as corporações de IA para proteger a segurança nacional.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essas alarmantes mensagens só aumentam o medo e a desconfiança, sem apresentar soluções concretas ou detalhes sobre os riscos reais da IA.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A preocupação do pesquisador destaca a importância de regulamentar a IA para evitar riscos, mas é necessário discutir evidências e ações específicas.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r2ei18",
      "rank": 12,
      "title": "Estudo revela causa genética da coagulação sanguínea relacionada às vacinas Johnson & Johnson e AstraZeneca",
      "label": "Causa genética da coagulação em vacinas",
      "context": "Pesquisadores identificaram uma causa genética para a coagulação sanguínea associada às vacinas Johnson & Johnson e AstraZeneca, relacionadas à condição VITT. O estudo explica que a reação ocorre devido a fatores genéticos específicos. Essa descoberta ajuda a entender melhor os efeitos colaterais dessas vacinas.",
      "source": "reddit",
      "subreddit": "science",
      "permalink": "https://www.reddit.com/r/science/comments/1r2ei18/blood_clotting_associated_with_both_johnson/",
      "createdAt": "2026-02-12T00:19:07+00:00",
      "rawScore": 269.57543298741695,
      "relevanceScore": 0.26136039100440883,
      "suggestedRadius": 66.67,
      "imageUrl": "assets/images/reddit_1r2ei18_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Essa pesquisa mostra que entender a causa genética pode ajudar a prevenir efeitos colaterais graves, fortalecendo a confiança nas vacinas.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Focar na causa genética pode atrasar a avaliação de riscos e reforçar a desconfiança nas vacinas, prejudicando a saúde pública.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A descoberta ajuda a entender melhor os efeitos colaterais, mas é importante continuar monitorando a segurança de todas as vacinas.",
          "source": "reddit",
          "votes": 0
        }
      ]
    },
    {
      "id": "reddit_1r1hera",
      "rank": 13,
      "title": "Drones ucranianos supostamente atacaram refinaria de petróleo na Rússia",
      "label": "Ataque de drones na Rússia",
      "context": "Drones supostamente ucranianos atacaram uma refinaria de petróleo em Volgograd, na Rússia. O evento foi relatado por mídia local e gerou debates sobre o conflito. As opiniões variam entre diferentes posições ideológicas.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r1hera/ukrainian_drones_reportedly_strike_russias/",
      "createdAt": "2026-02-10T23:49:15+00:00",
      "rawScore": 247.29914402642123,
      "relevanceScore": 0.23751586409438577,
      "suggestedRadius": 65.24,
      "imageUrl": "assets/images/reddit_1r1hera_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Ataques como esse mostram a força e determinação de Ukraine para defender sua soberania contra a agressão russa.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Esses ataques aumentam a violência e o sofrimento, sem contribuir para uma solução pacífica do conflito na região.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "O ataque destaca a complexidade do conflito e a importância de buscar negociações para evitar mais violência.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r2blnr",
      "rank": 14,
      "title": "Investigadores recuperaram vídeo de câmera Google Nest de Nancy Guthrie dos sistemas internos",
      "label": "Acesso a vídeo do Nest sem assinatura",
      "context": "Um vídeo de uma câmera Google Nest de Nancy Guthrie foi recuperado por investigadores, mesmo ela não tendo assinatura ativa. Isso levanta questões sobre armazenamento e acesso a dados de câmeras conectadas. O evento mostra como as informações podem ser acessadas por autoridades.",
      "source": "reddit",
      "subreddit": "technology",
      "permalink": "https://www.reddit.com/r/technology/comments/1r2blnr/investigators_wrangled_video_from_nancy_guthries/",
      "createdAt": "2026-02-11T22:21:12+00:00",
      "rawScore": 241.10876717058403,
      "relevanceScore": 0.230889688263185,
      "suggestedRadius": 64.83,
      "imageUrl": "assets/images/reddit_1r2blnr_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A recuperação mostra a eficácia das investigações e o papel das câmeras na resolução de crimes.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Isso revela a invasão de privacidade e o risco de vigilância constante, mesmo sem assinatura ativa.",
          "source": "reddit",
          "votes": 0
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A situação destaca a importância de entender como os dados de câmeras conectadas são armazenados e acessados pelas empresas e autoridades.",
          "source": "reddit",
          "votes": 0
        }
      ]
    },
    {
      "id": "reddit_1r230ho",
      "rank": 15,
      "title": "Presidente do Irã pede desculpas pela repressão violenta aos protestos",
      "label": "Reação do presidente iraniano à repressão",
      "context": "O presidente do Irã pediu desculpas pela repressão que resultou na morte de milhares de manifestantes. A repressão foi uma resposta às manifestações contra o governo. A situação gerou debates sobre a responsabilidade e as ações do governo iraniano.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r230ho/irans_president_apologises_for_brutal_protests/",
      "createdAt": "2026-02-11T17:06:26+00:00",
      "rawScore": 223.2638066962947,
      "relevanceScore": 0.2117884528203103,
      "suggestedRadius": 63.61,
      "imageUrl": "assets/images/reddit_1r230ho_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A desculpa mostra que o presidente está disposto a reconhecer erros, mesmo em um regime autoritário, o que pode indicar uma tentativa de melhorar a imagem internacional.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "O pedido de desculpas é uma tentativa vazia de encobrir a repressão brutal e não resolve a violência de um governo que massacrou seus próprios cidadãos.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A declaração do presidente pode ser vista como uma reação às críticas internacionais, mas não necessariamente indica uma mudança nas ações do governo iraniano.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r260pp",
      "rank": 16,
      "title": "Estimativas da NATO indicam altas perdas russas na guerra",
      "label": "Casualidades russas na guerra",
      "context": "A NATO divulgou estimativas de perdas russas na guerra na Ucrânia, incluindo números de soldados mortos e feridos. Essas informações refletem o impacto do conflito para a Rússia. O debate envolve opiniões sobre as consequências e a gravidade dessas perdas.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r260pp/nato_estimates_russian_casualties_on_the_front/",
      "createdAt": "2026-02-11T18:52:53+00:00",
      "rawScore": 203.73631694044366,
      "relevanceScore": 0.19088623900077037,
      "suggestedRadius": 62.21,
      "imageUrl": "assets/images/reddit_1r260pp_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Essas altas perdas mostram que a Rússia está sendo forte e resistente, mesmo com dificuldades, e que a guerra é uma demonstração de poder militar.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essas perdas representam o fracasso da política militar russa e mostram o custo humano e social que o conflito está causando para o país.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "As estimativas de perdas indicam o impacto do conflito na Rússia, mas é importante considerar os contextos políticos e militares ao interpretar esses números.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r1xit8",
      "rank": 17,
      "title": "EUA de 130 mil empregos em janeiro supera expectativas e taxa de desemprego fica em 4,3%",
      "label": "Mercado de trabalho dos EUA · Novas vagas em janeiro",
      "context": "Os Estados Unidos criaram 130 mil empregos em janeiro, segundo dados oficiais, o que foi mais do que o esperado pelos analistas. A taxa de desemprego permaneceu em 4,3%. Esses números influenciam a percepção sobre a saúde da economia americana.",
      "source": "reddit",
      "subreddit": "economics",
      "permalink": "https://www.reddit.com/r/Economics/comments/1r1xit8/us_payrolls_rose_by_130000_in_january_more_than/",
      "createdAt": "2026-02-11T13:34:25+00:00",
      "rawScore": 184.09420918352993,
      "relevanceScore": 0.1698613381387209,
      "suggestedRadius": 60.73,
      "imageUrl": "assets/images/reddit_1r1xit8_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "O aumento de empregos mostra que a economia dos EUA está forte e resistente, mesmo com desafios globais. Isso reforça a confiança no mercado e na gestão econômica atual.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Os números podem estar inflados por revisões e ajustes estatísticos. A real situação do mercado de trabalho ainda é preocupante, com crescimento fraco e setores estagnados.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "Os dados indicam uma recuperação moderada do mercado de trabalho, com setores como saúde e construção liderando as contratações. Ainda assim, é importante acompanhar as revisões futuras.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r2i8tl",
      "rank": 18,
      "title": "França pede a renúncia de Francesca Albanese após comentários antissemitas",
      "label": "Reação à declaração de Albanese",
      "context": "Francesca Albanese, especialista da ONU, fez comentários considerados antissemitas em um fórum da Al Jazeera. A França pediu sua renúncia devido às declarações. O episódio gerou debates sobre liberdade de expressão e limites éticos.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r2i8tl/france_demands_francesca_albanese_resign_after/",
      "createdAt": "2026-02-12T03:06:51+00:00",
      "rawScore": 167.70925007321557,
      "relevanceScore": 0.1523228873173299,
      "suggestedRadius": 59.42,
      "imageUrl": "assets/images/reddit_1r2i8tl_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "A França agiu corretamente ao exigir a renúncia de Albanese, reforçando a luta contra discursos de ódio e defendendo a segurança de Israel.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "A pressão da França é uma tentativa de silenciar críticas legítimas, limitando a liberdade de expressão e atacando quem questiona o poder.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A situação levanta debates sobre o limite entre liberdade de expressão e discurso de ódio, sendo importante avaliar o contexto das declarações de Albanese.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r1kwjk",
      "rank": 19,
      "title": "Exercício pode ser tratamento de primeira linha para depressão leve, dizem pesquisadores",
      "label": "Debate sobre exercício e depressão leve",
      "context": "Pesquisadores destacam que exercícios podem ajudar no tratamento de depressão leve, especialmente em jovens e mães recentes. A pesquisa enfatiza os benefícios de atividades em grupo. Algumas opiniões alertam para limitações e fatores sociais.",
      "source": "reddit",
      "subreddit": "science",
      "permalink": "https://www.reddit.com/r/science/comments/1r1kwjk/exercise_can_be_frontline_treatment_for_mild/",
      "createdAt": "2026-02-11T02:22:25+00:00",
      "rawScore": 124.28455129497763,
      "relevanceScore": 0.1058411146849885,
      "suggestedRadius": 55.52,
      "imageUrl": "assets/images/reddit_1r1kwjk_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Investir em atividades físicas nas escolas reforça a força e disciplina, ajudando na saúde mental e na formação de cidadãos mais resistentes.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Focar apenas em exercício como solução ignora fatores sociais e econômicos que influenciam a saúde mental, além de não tratar causas profundas da depressão.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "Exercício pode ajudar na depressão leve, mas deve ser considerado parte de um tratamento mais amplo, incluindo apoio psicológico e social.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    },
    {
      "id": "reddit_1r2n57x",
      "rank": 20,
      "title": "Suíça realizará votação sobre proposta de limitar a população a 10 milhões",
      "label": "Votação sobre limite populacional na Suíça",
      "context": "A Suíça está realizando uma votação para decidir se deve limitar sua população a 10 milhões de habitantes. A proposta envolve restrições à imigração e tem gerado debates públicos. A decisão pode impactar a política de imigração e o crescimento econômico do país.",
      "source": "reddit",
      "subreddit": "worldnews",
      "permalink": "https://www.reddit.com/r/worldnews/comments/1r2n57x/switzerland_to_vote_on_farright_proposal_to_cap/",
      "createdAt": "2026-02-12T07:28:37+00:00",
      "rawScore": 116.63234018079629,
      "relevanceScore": 0.09765019230322394,
      "suggestedRadius": 54.75,
      "imageUrl": "assets/images/reddit_1r2n57x_ai.png",
      "opinions": [
        {
          "id": "op1",
          "tone": "positive",
          "text": "Limitar a imigração é uma medida forte para proteger a cultura e a economia suíça, garantindo estabilidade e segurança para os cidadãos.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_right"
        },
        {
          "id": "op2",
          "tone": "negative",
          "text": "Essa proposta reforça o medo e a exclusão, prejudicando a diversidade e os direitos dos imigrantes que contribuem para a sociedade suíça.",
          "source": "reddit",
          "votes": 0,
          "ideology": "far_left"
        },
        {
          "id": "op3",
          "tone": "neutral",
          "text": "A votação reflete o debate sobre o crescimento sustentável e o controle de imigração, buscando equilibrar economia e recursos do país.",
          "source": "reddit",
          "votes": 0,
          "ideology": "liberal"
        }
      ]
    }
  ]
}